; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-2-22)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-2 - location
	p0-3 - location
	p0-4 - location
	p1-0 - location
	p1-2 - location
	p3-2 - location
	p4-1 - location
	p4-2 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s1)
	(at driver3 s1)
	(at driver4 s0)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at package1 s1)
	(at package2 s0)
	(at package3 s4)
	(at package4 s4)
	(at package5 s3)
	(at package6 s1)
	(at package7 s1)
	(at package8 s2)
	(at package9 s4)
	(at package10 s4)
	(at package11 s2)
	(at package12 s3)
	(at package13 s4)
	(at package14 s1)
	(at package15 s4)
	(at package16 s2)
	(at package17 s1)
	(at package18 s4)
	(at package19 s4)
	(at package20 s1)
	(at package21 s1)
	(at package22 s2)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s1 s3)
	(link s3 s1)
	(link s1 s4)
	(link s4 s1)
	(link s2 s4)
	(link s4 s2)
	(link s3 s0)
	(link s0 s3)
	(link s4 s0)
	(link s0 s4)
	(link s4 s3)
	(link s3 s4)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s0)
	(at truck2 s1)
	(at package1 s1)
	(at package2 s1)
	(at package3 s0)
	(at package4 s3)
	(at package5 s1)
	(at package6 s3)
	(at package7 s0)
	(at package8 s0)
	(at package9 s2)
	(at package10 s0)
	(at package11 s1)
	(at package12 s2)
	(at package13 s1)
	(at package14 s1)
	(at package15 s4)
	(at package16 s1)
	(at package17 s2)
	(at package18 s0)
	(at package19 s4)
	(at package20 s3)
	(at package21 s1)
	(at package22 s0)
	))


)

; plan
1. (board-truck driver2 s1 truck1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 5 of 25
2. (drive-truck driver2 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 5 of 25
3. (drive-truck driver2 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 5 of 25
4. (load-truck s4 package9 truck1)
   deleted: (at package9 s4)
   added: (in package9 truck1)
   goals met: 5 of 25
5. (load-truck s4 package4 truck1)
   deleted: (at package4 s4)
   added: (in package4 truck1)
   goals met: 5 of 25
6. (load-truck s4 package3 truck1)
   deleted: (at package3 s4)
   added: (in package3 truck1)
   goals met: 5 of 25
7. (load-truck s4 package18 truck1)
   deleted: (at package18 s4)
   added: (in package18 truck1)
   goals met: 5 of 25
8. (drive-truck driver2 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 5 of 25
9. (unload-truck s0 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s0)
   goals met: 6 of 25
10. (load-truck s0 package2 truck1)
   deleted: (at package2 s0)
   added: (in package2 truck1)
   goals met: 6 of 25
11. (unload-truck s0 package18 truck1)
   deleted: (in package18 truck1)
   added: (at package18 s0)
   goals met: 7 of 25
12. (drive-truck driver2 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 7 of 25
13. (load-truck s4 package13 truck1)
   deleted: (at package13 s4)
   added: (in package13 truck1)
   goals met: 7 of 25
14. (load-truck s4 package10 truck1)
   deleted: (at package10 s4)
   added: (in package10 truck1)
   goals met: 7 of 25
15. (drive-truck driver2 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 7 of 25
16. (unload-truck s0 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s0)
   goals met: 8 of 25
17. (board-truck driver1 s3 truck2)
   deleted: (at driver1 s3) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 8 of 25
18. (drive-truck driver2 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 8 of 25
19. (unload-truck s2 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s2)
   goals met: 9 of 25
20. (load-truck s2 package8 truck1)
   deleted: (at package8 s2)
   added: (in package8 truck1)
   goals met: 9 of 25
21. (drive-truck driver2 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 9 of 25
22. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 9 of 25
23. (load-truck s1 package7 truck1)
   deleted: (at package7 s1)
   added: (in package7 truck1)
   goals met: 9 of 25
24. (drive-truck driver2 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 9 of 25
25. (unload-truck s0 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s0)
   goals met: 10 of 25
26. (unload-truck s0 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s0)
   goals met: 11 of 25
27. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 11 of 25
28. (load-truck s1 package6 truck1)
   deleted: (at package6 s1)
   added: (in package6 truck1)
   goals met: 11 of 25
29. (load-truck s1 package20 truck1)
   deleted: (at package20 s1)
   added: (in package20 truck1)
   goals met: 11 of 25
30. (drive-truck driver2 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 11 of 25
31. (load-truck s3 package5 truck2)
   deleted: (at package5 s3)
   added: (in package5 truck2)
   goals met: 11 of 25
32. (drive-truck driver1 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 12 of 25
33. (unload-truck s1 package5 truck2)
   deleted: (in package5 truck2)
   added: (at package5 s1)
   goals met: 13 of 25
34. (load-truck s1 package17 truck2)
   deleted: (at package17 s1)
   added: (in package17 truck2)
   goals met: 13 of 25
35. (drive-truck driver1 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 12 of 25
36. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 12 of 25
37. (drive-truck driver2 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 12 of 25
38. (unload-truck s3 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s3)
   goals met: 13 of 25
39. (unload-truck s3 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s3)
   goals met: 14 of 25
40. (unload-truck s3 package20 truck1)
   deleted: (in package20 truck1)
   added: (at package20 s3)
   goals met: 15 of 25
41. (drive-truck driver2 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 15 of 25
42. (unload-truck s1 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s1)
   goals met: 16 of 25
43. (unload-truck s1 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s1)
   goals met: 17 of 25
44. (drive-truck driver2 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 17 of 25
45. (disembark-truck driver2 s0 truck1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s0) (empty truck1)
   goals met: 18 of 25
46. (drive-truck driver1 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 18 of 25
47. (load-truck s2 package22 truck2)
   deleted: (at package22 s2)
   added: (in package22 truck2)
   goals met: 18 of 25
48. (drive-truck driver1 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 18 of 25
49. (unload-truck s0 package22 truck2)
   deleted: (in package22 truck2)
   added: (at package22 s0)
   goals met: 19 of 25
50. (drive-truck driver1 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 19 of 25
51. (unload-truck s2 package17 truck2)
   deleted: (in package17 truck2)
   added: (at package17 s2)
   goals met: 20 of 25
52. (load-truck s2 package16 truck2)
   deleted: (at package16 s2)
   added: (in package16 truck2)
   goals met: 20 of 25
53. (drive-truck driver1 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 20 of 25
54. (drive-truck driver1 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 21 of 25
55. (unload-truck s1 package16 truck2)
   deleted: (in package16 truck2)
   added: (at package16 s1)
   goals met: 22 of 25
56. (drive-truck driver1 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 21 of 25
57. (drive-truck driver1 s0 s3 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 21 of 25
58. (load-truck s3 package12 truck2)
   deleted: (at package12 s3)
   added: (in package12 truck2)
   goals met: 21 of 25
59. (drive-truck driver1 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 21 of 25
60. (drive-truck driver1 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 21 of 25
61. (unload-truck s2 package12 truck2)
   deleted: (in package12 truck2)
   added: (at package12 s2)
   goals met: 22 of 25
62. (load-truck s2 package11 truck2)
   deleted: (at package11 s2)
   added: (in package11 truck2)
   goals met: 22 of 25
63. (drive-truck driver1 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 22 of 25
64. (drive-truck driver1 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 23 of 25
65. (unload-truck s1 package11 truck2)
   deleted: (in package11 truck2)
   added: (at package11 s1)
   goals met: 24 of 25
66. (drive-truck driver1 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 23 of 25
67. (disembark-truck driver1 s0 truck2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s0) (empty truck2)
   goals met: 24 of 25
68. (board-truck driver4 s0 truck2)
   deleted: (at driver4 s0) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 24 of 25
69. (drive-truck driver4 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 25 of 25
